<?
echo "<b>php-1-3-8</b><br><br>";

//8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$mass = [
    "Московская" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская" => ["Рязань", "Рыбное", "Косинов"],
];

define("LETTER", "К");

foreach ($mass as $state => $towns) {
    foreach ($towns as $key => $value) {
        // mb_substr — Возвращает часть строки.
        // Корректно выполняет substr() для многобайтовых кодировок, учитывая количество символов.
        if (mb_substr($value, 0, 1) == LETTER) {
            echo "$value\n";
            break;
        }
    }
}

