<?
echo "<b>php-1-3-3</b><br><br>";

//3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений –
// массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
//Московская область:
//Москва, Зеленоград, Клин
//Ленинградская область:
//Санкт-Петербург, Всеволожск, Павловск, Кронштадт
//Рязанская область … (названия городов можно найти на maps.yandex.ru)

echo "<br> Вариант 1 <br><br>";

$mass = [
    "Московская" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская" => ["Рязань", "Рыбное", "Косинов"],
];

foreach ($mass as $state => $towns) {
    echo "$state область: <br>";
    foreach ($towns as $key => $value) {
        echo " $value, ";
    }
    echo "<hr>";
}



echo "<br><br> Вариант 2 <br><br>";

$mass = [
    Московская => "Москва, Зеленоград, Клин",
    Ленинградская => "Санкт-Петербург, Всеволожск, Павловск, Кронштадт",
    Рязанская => "Рязань, Рыбное, Косинов",
];

foreach ($mass as $key => $value ){
    echo  $key . " область: <br> " . $value . "<br><hr>";
}



echo "<br> Вариант 3 <br><br>";

function city($arg) {
    $mass = [
        Московская => "Москва, Зеленоград, Клин",
        Ленинградская => "Санкт-Петербург, Всеволожск, Павловск, Кронштадт",
        Рязанская => "Рязань, Рыбное, Косинов",
    ];
    echo " {$arg} область:<br> {$mass["$arg"]} область <br><hr>";
}

city("Московская");
city("Ленинградская");
city("Рязанская");



echo "<br> Вариант 4 <br><br>";

for ($i = 0; $i <= 2; $i++) {
    switch ($i) {
        case 0:
            $arg = "Московская";
            echo " {$arg} область: <br> {$mass["$arg"]} область <br><hr>";
            break;
        case 1:
            $arg = "Ленинградская";
            echo " {$arg} область: <br> {$mass["$arg"]} область <br><hr>";
            break;
        case 2:
            $arg = "Рязанская";
            echo " {$arg} область: <br> {$mass["$arg"]} область <br><hr>";
            break;
    }
}